Tekla.Structures.Datatype.DistanceListConverter
The DistanceListConverter class converts types to and from the distance list type.

Tekla.Structures.Datatype.DistanceListConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the source type to the distance list type.
context: The context.
sourceType: The type to convert from.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.DistanceListConverter.CanConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the distance list type to the destination type.
context: The context.
destinationType: The type to convert to.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.DistanceListConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Converts an object from the given culture to the distance list type.
context: The context.
culture: The culture.
value: The object to be converted.
Returns: The new distance object.

Tekla.Structures.Datatype.DistanceListConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
Converts an object from the distance list type to the given destination type.
context: The context.
culture: The target culture.
value: The distance object to be converted.
destinationType: The destination type.
Returns: The given distance object converted to the new type.